export const colorsOld = [ 'blue', 'red', 'yellow', 'green', '#8A2BE2', '#00FFFF' ];

export const colors = [ 
 '#D3D3D3',
 '#DCDCDC',
 '#C0C0C0',
 '#808080',
 '#AFEEEE',
 '#E0FFFF',
 '#B0E0E6',
 '#B0C4DE',
 '#98FF98',
 '#70d84e',
 '#98FB98',
 '#F0FFF0',
 '#E6E6FA',
 '#D8BFD8',
 '#DDA0DD',
 '#DA70D6',
 '#FE5000',
 '#F9423A',
 '#EF3340',
 '#CE0058',
 '#FFDAB9',
 '#FFA07A',
 '#FFE4C4',
 '#FFE4B5',
 '#87CEEB',
 '#6495ED',
 '#4682B4',
 '#1E90FF' 
];

const cardSymbols = [ '♠', '♡', '♢', '♣', '♤', '♥', '♦', '♧' ];
const musicSymbols = [ '♩', '♫', '♬', '♭' ];
const chessSymbols = [ '♚', '♛', '♜', '♝', '♞', '♟' ];
const diceSymbols = [ '⚀', '⚁', '⚂', '⚃', '⚄', '⚅' ];
const lockSymbols = [ '🔒', '🔓', '🔏', '🔐', '🗝️', '🔑' ];
const lightSymbols = [ '💡', '🌟', '✨', '🌠', '💫', '🌞' ];
const ballSymbols = [ '🎱', '🎲','🪀', '🌞', '🌕', '🌑', '🌚', '⚽', '🏀', '⚾', '🎾', '🏐', '🏈', '🏉','🥎' ];
const racketSymbols = [ '🎳', '🏓', '🏸', '🏒', '🏑' ];
const fruitSymbols = [ '🍎', '🍓', '🍊', '🍒', '🍉', '🍌', '🍇' ];
const handSymbols = ['👍', '👎', '👌', '🤞', '✋', '🤚', '🖐️', '✍️', '👐', '🙌', '🤲', '🙏', '🤝', '💪', '👋', '🤙', '🤟', '👈', '👉', '👆', '👇', '☝️', '🖕', '🤘', '🤜', '🤛'];
const faceSymbols = [ '😊', '😃', '😄', '😁', '😆', '😅', '😂', '🙂', '😎', '😋', '😌', '😍', '🥰', '😘', '😗', '😙', '😚', '😉', '🙃', '🤗', '🤩', '😇', '😏', '😛', '😜', '🤪', '😝', '🤑', '🤭', '🤐', '😶', '😶‍🌫️', '😴', '🥱', '😒', '😔', '😟', '😕', '🙁', '😣', '😖', '😫', '😩', '🥺', '😢', '😭', '😤', '😠', '😡', '🤬', '🤯', '😳', '🥴', '😵', '😱', '😨', '😰', '😥', '😓', '🤔', '🤨', '🧐', '😬', '😮', '😯', '😲', '😧', '🤫', '🤥', '😷', '🤒', '🤕', '🤢', '🤮', '🤧', '🤠', '🥳', '🥵', '🥶', '🤓', '🙄' ];

export const symbolPool = [
  cardSymbols,
  musicSymbols,
  chessSymbols,
  diceSymbols,
  lockSymbols,
  lightSymbols,
  ballSymbols,
  racketSymbols,
  fruitSymbols,
  handSymbols,
  faceSymbols
];

// const allSymbols = [ ...cardSymbols, ...musicSymbols, ...chessSymbols, ...diceSymbols ]